[Tower_InvestigateTorturer DishonoredObjective]
m_Description="（可选）拜访拷问者"

[Tower_InvestigateTorturer:DishonoredTask_Custom_0 DishonoredTask_Custom]
m_Description="杀死拷问者"
m_Status=""

[Tower_InvestigateTorturer:DishonoredTask_Custom_7 DishonoredTask_Custom]
m_Description="找到拷问者的房间"
m_Status=""

[Tower_KillLordRegent DishonoredObjective]
m_Description="结束摄政王的统治"

[Tower_KillLordRegent:DishonoredTask_Custom_0 DishonoredTask_Custom]
m_Description="潜入顿沃高塔"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_1 DishonoredTask_Custom]
m_Description="与萨缪尔乘船到顿沃高塔"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_3 DishonoredTask_Custom]
m_Description="杀死摄政王"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_4 DishonoredTask_Custom]
m_Description="在顿沃高塔顶找到摄政王"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_5 DishonoredTask_Custom]
m_Description="（非致命方法）在摄政王的卧室找到音频记录"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_6 DishonoredTask_Custom]
m_Description="（非致命方法）在广播控制站播放摄政王的音频记录"
m_Status=""

[Tower_KillLordRegent:DishonoredTask_Custom_7 DishonoredTask_Custom]
m_Description="找到摄政王的卧室"
m_Status=""

[Tower_KillThePropagandaOfficer DishonoredObjective]
m_Description="（可选）广播站"

[Tower_KillThePropagandaOfficer:DishonoredTask_Custom_2 DishonoredTask_Custom]
m_Description="与宣传官交谈"
m_Status=""

[Tower_KillThePropagandaOfficer:DishonoredTask_Custom_7 DishonoredTask_Custom]
m_Description="找到广播控制站"
m_Status=""

[Tower_LeaveWithSamuel DishonoredObjective]
m_Description="逃离顿沃高塔"

[Tower_LeaveWithSamuel:DishonoredTask_Custom_0 DishonoredTask_Custom]
m_Description="与萨缪尔一起离开"
m_Status=""

[Tower_LeaveWithSamuel:DishonoredTask_Custom_7 DishonoredTask_Custom]
m_Description="到达萨缪尔的船并逃离顿沃高塔"
m_Status=""

[TowerEmpress_HideNSeek DishonoredObjective]
m_Description="（可选）捉迷藏"

[TowerEmpress_HideNSeek:DishonoredTask_Custom_1 DishonoredTask_Custom]
m_Description="（可选）和艾米莉捉迷藏"
m_Status=""

[TowerEmpress_HideNSeek:DishonoredTask_Custom_3 DishonoredTask_Custom]
m_Description="（可选）利用环境藏起来不让艾米莉找到"
m_Status=""

[TowerEmpress_HideNSeek:DishonoredTask_Custom_4 DishonoredTask_Custom]
m_Description="（可选）在石桥下与艾米莉见面"
m_Status=""

[TowerEmpress_LordProtector DishonoredObjective]
m_Description=皇家护卫

[TowerEmpress_LordProtector:DishonoredTask_Custom_0 DishonoredTask_Custom]
m_Description="保护女皇和艾米莉"
m_Status=""

[TowerEmpress_LordProtector:DishonoredTask_Custom_5 DishonoredTask_Custom]
m_Description="去拜见女皇"
m_Status=""

[TowerEmpress_Report DishonoredObjective]
m_Description="向女皇复命"

[TowerEmpress_Report:DishonoredTask_Custom_2 DishonoredTask_Custom]
m_Description="在凉亭与女皇见面"
m_Status=""

